[
  {
    "date": "2025-03-14",
    "images": [
      "images/day0.webp"
    ],
    "message": "Day 0 on trail: didn't sleep much on the plane from SF to Roanoke, but was still energized when I landed. Walked to pick up some food and supplies, I somehow ended up with like 17lbs of food 😅. then took a bus and shuttle to the trail. Before I even stepped foot on the trail I ended up with a pocket full of yogurt 🤣. Hike started with a big climb to a beautiful vista at McAfees knob. There looks to be tons of bouldering potential around the knob. Then kept hiking past Tinker cliffs, another beautiful vista, with lots of short trad potential. Stayed the night at Lamberts meadow shelter"
  },
  {
    "date": "2025-03-15",
    "images": [],
    "message": "Day 1- woke to insane morning fog, couldn't see the other tents less than 30 ft away. Fog gradually faded and was gone by 10. Caught up to 2 brothers that slept at the same shelter that night and hiked with them till Daleville. Got lunch in Daleville (@ cracker barrel, not a great choice). Hiked to the next shelter to prepare for the coming thunderstorm."
  },
  {
    "date": "2025-03-16",
    "images": [
      "images/day2.webp"
    ],
    "message": "Day 2- thunderstorm never came, but there was crazy dense fog in the middle of the night, couldn't see more than 3 feet. Insanely windy and damp all morning. Left the shelter at noon since it was on top of the Knob for a better time at the next shelter. Weather got better as soon as I left the knob."
  },
  {
    "date": "2025-03-17",
    "images": [
      "images/day3.webp"
    ],
    "message": "Day 3- Slept in till almost 9 despite the sun bearing down on me. Trail started weaving through Blue Ridge Parkway with beautiful vistas on both sides. Was about to go to sleep for the night when I met the first other thru hiker: Rope Bunny, who had just finished a 25 mile day (what I had just done in the past 2.5 days)."
  },
  {
    "date": "2025-03-18",
    "images": [
      "images/day4.webp"
    ],
    "message": "Day 4- After setting off from the shelter ahead of Rope Bunny, we did a bunch of back and forth for the rest of the morning, stopping for various things like water. As Rope Bunny told me, 'You can never really say goodbye on the trail.' We met for the possibly the last time (assuming I never catch up) at the shelter (more like a mansion) I was staying at for the night. Still had most of the day left, so played a bunch of solitaire (assuming I remembered the rules correctly)."
  },
  {
    "date": "2025-03-19",
    "images": [
      "images/day5-1.webp",
      "images/day5-2.webp",
      "images/day5-3.webp"
    ],
    "message": "Day 5- Met a section hiker in the morning who told me Wigle Distillery in Pittsburgh was named after one of the first people granted a presidential pardon, his ancestor. Hiked to the highest point I will reach on the trail, Apple Orchard Mountain at 4,225 ft, until Mt. Moosilauke in NH (highest point on the trail is Clingmans Dome in TN). Walked under the Guillotine, a large boulder suspended between other boulders. Made it to my shelter for the night where I met another section hiker who is on his last night of this section and gave me some food (a pizza MRE among other things)."
  },
  {
    "date": "2025-03-20",
    "images": [
      "images/day6-1.webp",
      "images/day6-2.webp"
    ],
    "message": "Got a beautiful view of the James River, which I then had to walk down 2000 ft to get to. Walked across the James River Foot Bridge, the longest foot-use-only bridge on the AT to highway 501. Stuck my thumb out for my first hitch ever and the first car that passed pulled over and gave me a ride to Glasgow VA. Got some wonderful Italian food from the local restaurant and called it a night at the towns hiker shelter."
  },
  {
    "date": "2025-03-21",
    "images": [],
    "message": "First 0 day. Did my laundry for the first time, put everything in the washer and dryer as I sat commando in my rain gear. Resupplied and relaxed."
  },
  {
    "date": "2025-03-22",
    "images": [
      "images/0322-1.webp",
      "images/0322-2.webp"
    ],
    "message": "Got a free shower from a hostel that wasn't even open. Hitched back to the trail. Tons of people on this section of the trail from trail runners to section hikers. Accidentally went 10 miles (mostly uphill) with only 1 L of water. Busy shelter tonight with 5 other people staying."
  },
  {
    "date": "2025-03-23",
    "images": [
      "images/0323.webp"
    ],
    "message": "Got some advice from a thru hiker finishing his SOBO journey that was stopped by Helene last year. Spent most of the morning playing leapfrog with section hikers on the same itinerary as me. Finished the day with a long climb to the shelter. A day hiker made some camp bread with honey butter for me. Another busy night in the shelter."
  },
  {
    "date": "2025-03-24",
    "images": [
      "images/0324.webp"
    ],
    "message": "Rainy morning start up to the peak of Cole Mountain, an appalachian bald. When I got to the peak, fog started rolling in that stayed for a couple of hours. Wet rocks caused me to slip a foot into one of the creeks I was going over. Once I got to the shelter I went to get water and once again doused my foot in a bog. 5 people at the shelter again, possibly last night with the 3 section hikers I have been hiking with for the past few days."
  },
  {
    "date": "2025-03-25",
    "images": [
      "images/0325.webp"
    ],
    "message": "Long decline at the start of the day, just to go right back up to the same elevation by the end of the day. Spent the morning trying to outrun afternoon rain, wasn't successful but the rain wasn't too bad. First night alone in a shelter in a while."
  },
  {
    "date": "2025-03-26",
    "images": [
      "images/0326-1.webp",
      "images/0326-2.webp"
    ],
    "message": "Woke up before sunrise, packed and got ready to go as fast as possible. Then started booking it for Waynesboro VA, about 20 miles away. Made it to a shelter for lunch where I met a PCT thru hiker checking out the AT for the first time. Made it to Waynesboro by 3:45, making 20 miles in just about 7 and a half hours. Got some mail, did laundry and had a nice Indian dinner. Unfortunately the free tenting area wasn't open so I was forced to spend the night in a hotel and took a nice warm shower."
  },
  {
    "date": "2025-03-27",
    "images": [
      "images/0327-1.webp",
      "images/0327-2.webp",
      "images/0327-3.webp"
    ],
    "message": "Had as much food as I could at the mediocre continental breakfast at the hotel. Went to the post office to get rid of a couple things. Resupplied at Kroger for all of Shenandoah. Had a huge sandwich at the local deli (Delly Up) and then got a hitch to the trail. Short hike with a lot of other day hikers. Was too full from town food to have dinner, just had some chocolate. 2 other hikers joined at the shelter, but cowboy camped away from the shelter and didn't say much to me."
  },
  {
    "date": "2025-03-28",
    "images": [],
    "message": "Boring day with no vistas. I was worried about no springs on the trail until the next shelter, so I mistakenly brought 3 liters. Only ended up using 1 before I got to the next shelter. Met 3 other thru hikers at the shelter, 2 of whom stayed with me the previous night. 1 thru hiker, Jimni, was just 20 miles into her journey while the other 2, a father daughter pair, started in Georgia mid-February. 4 other backpackers joined at the shelter for the night."
  },
  {
    "date": "2025-03-29",
    "images": [
      "images/0329.webp"
    ],
    "message": "Started the day by getting to the rocky summit ledge of Blackrock Mountain. Lots of vistas overlooking the valley below. 1st real hot day on the trail. A bit underwhelmed by Shenandoah; hasn't felt very secluded as you can almost always hear cars (or motorcycles) on Skyline Drive. A section hiker named Greenwave that stayed the night at the same shelter before joined me for another night."
  },
  {
    "date": "2025-03-30",
    "images": [
      "images/0330-1.webp",
      "images/0330-2.webp",
      "images/0330-3.webp"
    ],
    "message": "Very chill morning with mostly flat trail. Spent a lot of the morning leapfrogging Greenwave. Eventually, I made it to Lewis Mountain Campstore, one of two open stores in the park, where i bought snacks and some ice cream. Hung out at the campstore to eat lunch and charge my phone. Then continued to Rock Spring Hut, seeing some wild turkeys on the way. Met up with the father daughter thru hiker pair, Too Easy and Frozen at the shelter where we could hear lots of children staying at the Cabin 0.1 miles down the hill."
  },
  {
    "date": "2025-03-31",
    "images": [
      "images/0331-1.webp",
      "images/0331-2.webp",
      "images/0331-3.webp"
    ],
    "message": "Started the day early to try to outrun the storm forecast for 2pm. Right after the rain ended at 7ish I hit the trail. Made it to the summit of Stony Man Mountain, the highest point on the trail in Shenandoah. Then made it to Mary's Rock where I met a very nice hiker named Slo who gave me 2 stinger waffles. Got to the shelter by 2pm and hung out watching the birds and deer wander right up to the shelter. Storm started at 6pm, wasn't as bad as it was forecasted."
  },
  {
    "date": "2025-04-01",
    "images": [],
    "message": "Slow morning for a shorter, rest-like day. Had lunch at a, unfortunately closed, wayside. Got to the shelter, but decided not to sleep in it due to the resident Rat, named Anabelle, that has lived there for years and steals people's things. Once again, Frozen and Too Easy caught up to me and stayed at the same shelter. Dylan came at dusk and brought glorious camaraderie, pizza and permethrin (don't want to get Lyme disease). All things that I needed to keep me going."
  },
  {
    "date": "2025-04-02",
    "images": [
      "images/0402-1.webp",
      "images/0402-2.webp"
    ],
    "message": "Started the day early so I could get to Front Royal and not have to spend the night there. Quickly summited Marshall Mountain. As I was leaving Shenandoah National Park and descending into the valley, it seemed like I was fast forwarding through spring – tons of green, red and purple in the trees which were not evident in the park. Hitched a ride to Front Royal (after being engulfed by black smoke of a passing truck rolling coal), picked up my package of gourmet freeze dried meals from my dad, and headed out for lunch. Ended up with a breakfast burrito, empanada, and cinnamon roll (which I had been dreaming about for the past couple days). Went next door to the local outfitter where they gave me some free cord as backup for my tent cord. Then hung out at the brewery until the local, free trolley took me back to the trail. Made it to a glorious shelter with horseshoe, pavilion, deck, and a solar shower, with enough time to make dinner before sundown."
  },
  {
    "date": "2025-04-03",
    "images": [
      "images/0403-1.webp",
      "images/0403-2.webp"
    ],
    "message": "Nice and relaxing morning hanging out at the beautiful shelter to kill time since I'm only hiking 10 miles. Ate both breakfast and lunch at the shelter, but was eventually chased out of the shelter by a growing horde of hornets (that were not there last night). Very humid day, but an easy hike. Got to a creek and filled up water, anticipating another hour of hiking, but then turned a corner and the shelter was there. Met another 2 thru hikers: Meant2Be, started at the south of Shenandoah, and  Spartacus, started in GA in February. Spartacus told me about his snowy time in the Smoky Mountains and how he regularly does 25+ mi days."
  },
  {
    "date": "2025-04-04",
    "images": [
      "images/0404-1.webp",
      "images/0404-2.webp"
    ],
    "message": "Super heavy rain last night. Was supposed to rain most of the day, but only a light drizzle when I started hiking in the morning. Leapfrogged some section hikers for the easy morning. Then plunged into the roller coaster, 13.5 mi of tightly packed ascents and descents, after lunch. The roller coaster was somewhat similar to the Rachel Carson Trail in Pittsburgh, PA, but lacked the steepness that the RCT has. All of the hills on the roller coaster were as tall as the tallest hill on the RCT. As soon as you got up the hill, you just go right back down the other side. I did 10 out of the 13.5 mi and then Noah picked me up for a relaxing weekend in NoVA. We went to a delicious TexMex place nearby for lunch."
  },
  {
    "date": "2025-04-05",
    "images": [
      "images/0405.webp"
    ],
    "message": "Zero day in NoVA with Noah. Started the day with a fancy all you can eat breakfast at the local Hilton, where I ate too much food and was too full to function for a few hours. We then went to REI so I could get a smaller and more functional knife. Resupplied at the local Wegmans. We ended the day with a short metro trip to Virginia Square for a large Italian dinner. We walked around a little and got some ice cream and a freshly baked cookie. Was able to spray my clothes and tent with the permethrin from Dylan, so hopefully no ticks for the next month. Capped off the night with a new spy movie at Noah's place."
  },
  {
    "date": "2025-04-06",
    "images": [
      "images/0406-1.webp",
      "images/0406-2.webp",
      "images/0406-3.webp"
    ],
    "message": "Started the day off right with some delicious cheese blintzes with Noah. Then he drove me back to where he picked me up from, and I started back on the trail.  At first I forgot I was in the middle of the Rollercoaster, but quickly realized as I was going up and down hills. Finished the last 3 miles of the Rollercoaster and encountered my first state line. Took a long break at the Blackburn AT Center which had a nice hiker bunk with a wood stove inside. Got to the shelter for the night with plenty of light left."
  },
  {
    "date": "2025-04-07",
    "images": [
      "images/0407-1.webp",
      "images/0407-2.webp",
      "images/0407-3.webp",
      "images/0407-4.webp",
      "images/0407-5.webp"
    ],
    "message": "Woke up to another cold, foggy, and rainy morning. Relatively easy morning hike into Harper's Ferry, WV. Made it to the Appalachian Trail Conservancy Headquarters by noon. I registered as a thru hiker, got my picture in the book, and got my AT hangtag for my bag (even got a gold star for my knowledge of leave no trace principles). Had lunch at a local sandwich shop which was overwhelmed with a bunch of elementary or middle school kids on a field trip. Then had the flattest 3 miles of the trail as I walked on the path shared with the C&O canal towpath (which I biked with Monica almost 2 years ago). The trail quickly gained over 1000 ft of elevation to get to the top of the ridge where the trail stays for the remainder of Maryland. Walked through 3 different states today."
  },
  {
    "date": "2025-04-08",
    "images": [
      "images/0408-1.webp",
      "images/0408-2.webp",
      "images/0408-3.webp"
    ],
    "message": "Walked for 5-10 minutes on what seemed like the trail, but it turned out to not be the trail. A good lesson to always keep an eye out for trail blazes. Was hoping to get a free shower at the local backpacker's campground, but it was still closed for the season. Saw the first monument constructed for George Washington, built by the townspeople of Boonsboro, MD on July 4th, 1830. Saw the first set of people maintaining the trail where I tested out some rocks they had just placed in the trail. Met a group of trail patrol people who gave me a granola bar (don't ever say no to trail magic). Made it to my initially planned shelter, but decided I'd rather go 5 more miles to the nicer shelter. Walked through the first meadows I've encountered so far and stood at the top of Raven Rocks with an amazing view. Started getting cold as soon as I made it to the final shelter for the night."
  },
  {
    "date": "2025-04-09",
    "images": [
      "images/0409-1.webp",
      "images/0409-2.webp",
      "images/0409-3.webp",
      "images/0409-4.webp",
      "images/0409-5.webp",
      "images/0409-6.webp"
    ],
    "message": "Coldest night so far last night, woke up to another partially frozen water bottle. Made a quick stop at High Rock in Maryland for a nice view and tons of graffiti. Finished off Maryland and crossed the Mason-Dixon line into Pennsylvania. Less than 5 minutes after entering PA, a man on the trail asked me if I saw a big bird, I said no and we both went on our way. Later bumped into another thru hiker who told me that man was looking for a missing emu that had been spotted by other hikers on the trail. Hitched into Rouzerville, PA and picked up my second pair of shoes and a boatload of yummy snacks that Monica sent to me. Ate a whole medium size pizza at the local pizza joint and resupplied at the local Walmart. I was packing up my bag at the local Sheetz, getting ready to head back to the trail, and a man came out of the store to offer me a ride back to the trail when he bought what he needed. Then had a short 6 mile finish to the day."
  },
  {
    "date": "2025-04-10",
    "images": [
      "images/0410-1.webp"
    ],
    "message": "The day started out both cold and rainy. I didn't expect the rain to continue, so I started hiking without any rain gear on. Eventually I got too cold and wet, so I ended up throwing on both my rain jacket and pants. Dealing with a shin splint issue on only my left leg, but was testing out a shorter stride and better footstrike that seemed to alleviate all the pain (along with the new and better shoes). Ended the day early at one of the nicest shelters so far because the shelter I planned on stopping at was closed for a Bat Bug infestation. A section hiker named Unexpected stayed at the shelter with me where we played checkers until we got too cold and retreated to our sleeping bags. He was named Unexpected because he saw the loose emu on trail in Maryland a couple days ago."
  },
  {
    "date": "2025-04-11",
    "images": [
      "images/0411-1.webp",
      "images/0411-2.webp"
    ],
    "message": "Yet another cold day on the trail. Thankfully, it was not rainy like yesterday, but I didn't see the sun all day due to heavy fog. No shin splint pain; seems like the change in stride, footstrike, and shorter days seem to be helping. Finally saw a video of the loose Emu from a pair of thru hikers, Almighty and Feisty, that I had met on my last night in Maryland. Passed the official halfway point on the trail. Spent most of the afternoon, staying warm in my sleeping bag since I took another short day for the shin splint."
  },
  {
    "date": "2025-04-12",
    "images": [
      "images/0412-1.webp",
      "images/0412-2.webp"
    ],
    "message": "Woke to another grey morning, but thankfully, there was no rain. After a short walk, I made it to the halfway ceremonial marker that doesn't ever move. Then I rolled into Pine Grove Furnace State Park, where I was hoping to explore the AT Museum, but unfortunately, it was closed. Julia and Rick met up with me at the State Park and gave me a wonderful, warm McDonald's second breakfast. After eating, we all started hiking to the next shelter for the night. We stopped for a beautiful view at Pole Steeple and made it to the shelter with tons of time to hang out before dark. Eventually, Fiesty and Almighty caught up to us at the shelter. We played some cards and chatted until the sun set. At some point,  Luscious, who I haven't seen since Glasgow, VA, made it to the shelter. All in all, a wonderful day."
  },
  {
    "date": "2025-04-13",
    "images": [
      "images/0413-1.webp",
      "images/0413-2.webp"
    ],
    "message": "Sad start to the day saying goodbye to Rick and Julia so they could walk back to their car while I carried on to the North. Less than 2 miles after starting the day, there was a deli that I stopped at for a small resupply and food. Seconds after stepping onto the porch of the deli, my nose started randomly gushing blood, and I rushed to stuff toilet paper up my nose to not get blood all over everything. Ended up with blood on my clothes, backpack, and even the porch of the deli. Bought an egg and cheese sandwich, fresh baked cinnamon sticks, and a fried fish sub from the deli with a wad of toilet paper stuffed up my nose. Once it seemed like the nosebleed had stopped, I continued hiking for the day with a wad of toilet paper up my nose just in case. Scrambled through a cool rock maze where I had to set my trekking poles down at one point to get over a rock. Finished the short hike by 1pm and hung out at the shelter, waiting for Fiesty and Almighty to catch up with me.  They made it in about 1.5 hours later, and we chatted for the rest of the evening. As soon as we all laid down to sleep for the evening, we heard a large pack of coyotes howling not too far from our shelter, a cool but eerie sound."
  },
  {
    "date": "2025-04-14",
    "images": [
      "images/0414-1.webp",
      "images/0414-2.webp",
      "images/0414-3.webp"
    ],
    "message": "Said goodbye to Fiesty and Almighty, possibly for the last time, as I was going to start picking up the pace again since my shin splint was feeling better. Made it to Center Point knob then walked out into fields and pastures for the next 10 miles. As soon as I got into the fields I saw a pair of bald eagles flying from tree to tree as I walked towards them. Stopped in Boiling Springs for breakfast at a restaurant. After finishing my food, I asked the waiter for my check, but he informed me that the people that had just left paid for my meal, a wonderful instance of trail magic. Continued walking through pastures and stopped at an ATC owned farm for lunch, and a day hiker gave me a Larabar (two instances of trail magic in one day!). I made it back into the mountains where my shelter was by the end of the day."
  },
  {
    "date": "2025-04-15",
    "images": [
      "images/0415-1.webp",
      "images/0415-2.webp",
      "images/0415-3.webp",
      "images/0415-4.webp"
    ],
    "message": "Some more field walking today. Made it to Duncannon, PA where the trail goes right through the middle of town. First stop was 7/11 to get a slurpee and more peanut butter. Then I stopped at the only restaurant in town that seemed to be open that day for lunch. My final stop in town was the post office where the post woman was very kind and has a large hiker box full of tons of good food. I picked up two resupply boxes from Rachel that I almost couldn't fit into my pack. Crossed the Susquehanna River on the side of the highway and had a large rocky ascent to the ridgeline. I could see the valley on both sides of the ridge. Eventually I saw dark clouds looming in the distance so I hurried to the next shelter to avoid a potential storm. Made it to the shelter where I met a curmudgeon that complained about everything. Eventually the sky was clear so I continued to the next shelter. As I walked to the next shelter, I saw several more heavy rains coming in from the valley. I would throw on my jacket and brace for the storm and I would barely get any rain."
  },
  {
    "date": "2025-04-16",
    "images": [
      "images/0416-1.webp",
      "images/0416-2.webp"
    ],
    "message": "Another cold morning start with heavy wind that was blowing all day. Mostly walking along the ridgetop. Eventually, I leave the ridegetop to go through a gap, then hike right back up to the ridgetop. Hiked past an old, abandoned mining village, Yellow Springs. Tried to go see an old steam mining shovel called the General, but the side trail had a creek on it that didn't have any easy way to pass it. Made it to an area usually flooded because of a beaver dam downstream, but luckily the water was low enough that I could tiptoe and scramble across logs and not get wet. Summited Second Mountain, which had recently had a wildfire that was started by a lightning strike. Made it to the Stay AT Swattara hostel where I once again met up with Luscious. Set up my tent in the lawn, had a shower, did my laundry, and cooked myself a frozen pizza from the hostel. Luscious had extra from his resupply box that he gave to me."
  },
  {
    "date": "2025-04-17",
    "images": [
      "images/0417-1.webp",
      "images/0417-2.webp",
      "images/0417-3.webp"
    ],
    "message": "Tried to sleep in this morning since I only planned for a 10 mile day, but my body woke me up at 7 am. Had an applejack poptart for breakfast, like everything, it was better with peanut butter.  Took the morning slowly and left the hostel by 10 am. Met a dayhiker when I stopped for a rest at a nice viewpoint (Little Mountain). He told me that the PA rocks would really kick in on my next day on the trail. Ended the day at 501 shelter, which had 4 walls and doors! Talked with the caretaker of the shelter who mentioned that the ATC is tearing down the shelter next year and getting rid of a bunch of water sources along the trail in PA, which is already scarce with water. Chatted with a LASHer (Long Ass Section Hike) named Blowtorch, who has hiked parts of the trail from March to October for many years. Got a large pizza delivered to the shelter and ate every slice except for one that I gave to Blowtorch. Had the saddest cannoli of my life (soggy and tasteless shell) from the same delivery."
  },
  {
    "date": "2025-04-18",
    "images": [
      "images/0418-1.webp",
      "images/0418-2.webp",
      "images/0418-3.webp"
    ],
    "message": "Challenged myself to a 29.6 mile day today, so I started hiking shortly after sunrise. Not even halfway through my hike, I met my first trail angel: Four Feet. He had set up at a trailhead with a cooler full of drinks, 4 different bins full of snacks and candy, a box full of fried chicken, and some cornbread. I stopped, ate about 1000 calories worth of food, and grabbed some candy bars to go. I kept moving until Port Clinton, PA, where I stopped at the local barber shop: a hiker friendly hangout spot. At the barber shop, they had free cookies and Gatorade powder for hikers along with walls full of antiques, collectible coins, and racks of guitars. After getting my fill of cookies, I was informed of a gourmet grilled cheese food truck that was on my way out of town, so I had to stop. I designed my own grilled cheese with a fried egg and every veggie they had in the truck and ate it within minutes. Then I hiked as fast as I could to the shelter to make sure I got there before sundown. After climbing out of Port Clinton, I started noticing rubbing issues with both of my feet due to the sweaty socks I was wearing all day. I added moleskin, but it didn't seem to help. Finally made it to the shelter, successfully completing my 29.6 mile challenge, but my feet were rubbed raw in several spots. Learned a valuable lesson about switching out socks often when it's hot and there is lots of sweat."
  },
  {
    "date": "2025-04-19",
    "images": [
      "images/0419-1.webp",
      "images/0419-2.webp",
      "images/0419-3.webp",
      "images/0419-4.webp",
      "images/0419-5.webp",
      "images/0419-6.webp"
    ],
    "message": "A beautiful blue sky day. I was a bit worried about seeing rattlesnakes all day because a section hiker showed me a picture of a 30 inch long rattlesnake he saw the day before when he was going the other way on this section of the trail. Pretty quickly made it to the steep, rocky incline to Pulpit Rock with a great view. Then I continued moving through more rocks to the Pinnacle with a large black snake sunbathing in the bushes and another great view. There were lots of day hikers at both Pulpit Rock and the Pinnacle. Most of the day consisted of rocks on the trail, ranging anywhere from fist size to full on talus fields. Learned from yesterday that I need to switch socks every 2 hours and let the other socks dry on my pack, which worked out very well for my feet. Met Moon and Tiedye at the shelter who were SOBO section hikers. Moon had previously thru hiked and gave me a lot of good advice about the trail."
  },
  {
    "date": "2025-04-20",
    "images": [
      "images/0420-1.webp",
      "images/0420-2.webp",
      "images/0420-3.webp",
      "images/0420-4.webp"
    ],
    "message": "Talked with Moon and Tiedye about what was ahead for the day, and they got me excited about some scrambling opportunities. The day was full of lots of rock hopping. Made it to Knifes Edge, which I was warned that I should put my poles on my pack, but I didn't even realize I was there and kept hiking through it with both my poles. Accidentally hiked right past the scrambling opportunity at Bear Rocks because it didn't seem big enough. Made it to Bake Oven Knob with a lovely view where I stopped for a quick break. After lunch I started seeing smoke from a large forest fire in the distance and even heard planes flying over to try to put out the fire. Eventually, I made it to my shelter for the night, which had the trail going right in front of it. The trail there seemed to be a popular day hiking spot, so people kept walking by until dark with lots of people asking me about thru hiking."
  },
  {
    "date": "2025-04-21",
    "images": [
      "images/0421-1.webp",
      "images/0421-2.webp",
      "images/0421-3.webp",
      "images/0421-4.webp"
    ],
    "message": "After coming down into Lehigh Gap in the morning, I took a 2.5 mile detour into the town of Palmerton. I stopped into Bert's restaurant for a hearty breakfast and then went to the local grocery for a resupply and some donuts from the gourmet donut shop inside. After walking back from my detour, I was faced with a huge climb out of Lehigh Gap. I thought the climb was super fun and had some nearly vertical sections that almost required climbing like moves. Once I got to the top, I met a Mennonite family that gave me a honey bun. Then, I ran into a trail crew that was smashing all the big rocks into smaller rocks (not sure why that is preferred, I definitely like the larger rocks). The rest of the way to the shelter was just sharp, small, painful rocks that beat up my feet for the next 10 miles. Made it to the shelter, which already had 2 people camping in it. One more, Crazy B, came in later and joined us for the night."
  },
  {
    "date": "2025-04-22",
    "images": [
      "images/0422-1.webp",
      "images/0422-2.webp"
    ],
    "message": "Woke up with my feet still sore from all of the sharp rocks from the previous day. The first 10 miles were more sharp, pointy rocks with a descent into Wind Gap and an ascent right back out of it. Eventually, I made it to Wolf Rocks, a cool rocky ridgeline but sadly without a view. Afterwards, I popped out onto a nice and mostly flat gravel road that took me to the summit of Mt Minsi. Mt Minsi had a great view of the Delaware River to the South. I descended into Delaware Water Gap to a free hostel at the local church. There, I met up with 2 of the people from the shelter last night, Crazy B and Two Ts, who were injured and took a shuttle to the hostel. Eventually, FB made it to the hostel, the final person from the shelter last night. I did laundry at the hotel down the road, combining some clothes from the other hikers since it was a large washer and dryer. Took a shower at the hostel, which had disposable body towels. Then Crazy B treated FB, Two Ts, and me to a dinner at the local pizza and Italian joint where I got an eggplant parmesan. Crazy B also provided us an Apple Pie from the local pie shop for dessert."
  },
  {
    "date": "2025-04-23",
    "images": [
      "images/0423-1.webp",
      "images/0423-2.webp",
      "images/0423-3.webp",
      "images/0423-4.webp"
    ],
    "message": "In the morning, I saw Moon and Tiedye again because they were shuttling Crazy B and Two Ts 10 miles out from the next shelter since they still weren't feeling 100%. Then, I walked over the Delaware River on the I-80 bridge and left Pennsylvania. Luckily, the climb into New Jersey had much fewer rocks than the past couple of days, and the rocks that did exist were much less sharp. After hiking up into NJ I made it to Sunfish Pond. I met a group of dayhikers and one of them told me he was the 1000th person to thru hike the AT in the 1980s. He gave me nearly every snack he had in his daypack and said he would just take food from his buddies' packs. I stopped at the AMC Mohican Center for a chickpea salad wrap for lunch. The day was hot, but thankfully there were many more water sources in NJ than most of PA. Hiked with a group of section hikers for an hour of the day. When I got to the shelter, FB, Crazy B, and Two Ts were all already there. Crazy B got me a bagel with cream cheese on her ride over to the shelter that Two Ts carried in for me."
  },
  {
    "date": "2025-04-24",
    "images": [
      "images/0424-1.webp",
      "images/0424-2.webp",
      "images/0424-3.webp",
      "images/0424-4.webp"
    ],
    "message": "I was hoping to stop by a tavern that was less than 0.5 miles off trail, but it didn't open until 2 hours after I got there. Lots of PUDs (pointless ups and downs) for most of the day. Made it to a very nice pavilion at Sunrise Mountain. Had lunch at a nice viewpoint. Then walked into High Point State Park where the first stop was a viewing platform for the monument. Then I dropped my pack on the trail for the 0.3 mile detour to the monument which was mostly uphill and I was able to jog on the way back to my pack. The shelter was only 0.5 miles down the trail where I met up with FB once again. Found a tick on the floor of the shelter as I was chatting with FB and later found an embedded tick on myself that I was able to get off cleanly."
  },
  {
    "date": "2025-04-25",
    "images": [
      "images/0425-1.webp",
      "images/0425-2.webp",
      "images/0425-3.webp",
      "images/0425-4.webp"
    ],
    "message": "First stop of the day was Unionville, NY even though I was technically still on the trail in NJ. I went to the post office for a package of snacks that Monica sent me. When I pulled my food bag out of my backpack to put the snacks in another tick flew out of my bag! Walked across the road to the general store where I got an egg and cheese sandwich for second breakfast. As I kept walking down the trail, I once again walked into NY while in the Wallkill nature preserve. Made it to the nearly 1 mi long boardwalk in NJ where I saw a huge turtle munching on an apple someone dropped. Right after the boardwalk, I stopped at Heavenly Hills farm, where I got ice cream, apple cider donuts, and cheese. Ate everything except for the cheese and then was faced with the stairway to heaven, a 1000 ft rocky ascent. After the stairway was a great view of the valley below. I kept walking and found some trail magic, someone had left a box of root beers for the hikers and I quickly drank one. Kept walking to Warwick Turnpike where I was picked up by David. He had snacks and cold drinks ready in the car for me knowing I would be hungry. We stopped by the grocery store on the way back to his house so I could resupply. At his house I was able to take a luxurious shower and do my laundry. Lisa, David's wife, made an amazing meal of Salmon, baked sweet potatoes, and broccoli. We then had cheesecake, cannolis, and fruit for dessert. I then slept on a nice and comfortable bed for the first time."
  },
  {
    "date": "2025-04-26",
    "images": [
      "images/0426-1.webp",
      "images/0426-2.webp",
      "images/0426-3.webp",
      "images/0426-4.webp",
      "images/0426-5.webp"
    ],
    "message": "I was able to sleep in a bit in the comfortable bed that David provided. Had a nice breakfast of yogurt, granola, and fruit. I packed my bag with my resupply, half a cheesecake, one cannoli, and half a veggie wrap. David drove me back to the trail as it started to rain. I started hiking by noon. The hike started on a boardwalk, but eventually, I was on a rocky ridgetop that would bring me into New York for good. Due to the on and off rain, the rocks were slippery. I slipped once while eating the veggie wrap and a second time even while using both poles. NY started with the highest point on the trail in the state. I saw a cool orange newt on the trail. After a while, the rain stopped, and I came down from the ridgetop. I decided to stop by Bellvalle Farms creamery and got a delicious scoop of ice cream on a waffle cone. As I was finishing my ice cream, a man walked up to me and asked if I was a thru hiker. I responded, \"Yes,\" he handed me $10 and gave me his email so I could send him pictures of the trail. It was only 3 miles until the shelter where I had the half cheesecake for dinner. It thunderstormed and downpoured for 30 minutes right before bed, but then didn't rain anymore."
  },
  {
    "date": "2025-04-27",
    "images": [
      "images/0427-1.webp",
      "images/0427-2.webp",
      "images/0427-3.webp"
    ],
    "message": "Perfect ~50 °F day. Lots of PUDs (pointless ups and downs) today with scrambles on some of the climbs and descent. Made it to the Lemon Squeezer, a tight corridor of rock. Right afterward, there was a nearly vertical section that I had to throw in a climbing move to get up. Had a long day of PUDs to get to a shelter (that was 1.3 miles off trail) with a breathtaking view of the New York City skyline and the Hudson River. Unfortunately, the shelter also had a lot of very fearless mice that came out as the sun went down. It was amazing to see the skyline at night, all lit up with electric lights."
  },
  {
    "date": "2025-04-28",
    "images": [
      "images/0428-1.webp",
      "images/0428-2.webp",
      "images/0428-3.webp",
      "images/0428-4.webp"
    ],
    "message": "Tried to wake up for sunrise, but timed it poorly, and the sun was mostly over the horizon before I got up. Still was amazing to see the sunrise colors and the sun bouncing off the NYC skyline. Had to hangout at the shelter for a bit because I didn't want to get to the Bear Mountain Zoo (which the trail goes straight through) before it opened. Started hiking towards Bear Mountain, which had a tower with great views in every direction. Then, I descended the mountain to the zoo. I saw my first bear on trail, but he was too sleepy to care. I also saw a porcupine, fox, muskrat, hawks, owls, and a peregrine falcon. After the zoo I made a 1 mile detour to a pizza place in Fort Montgomery. I had a whole large cheese pizza to myself. Then I crossed the Hudson and climbed back onto the ridgetop. Wasn't the smartest idea to eat a whole pizza before finishing the day, but I made it through the remaining 6 miles. Passed the Appalachian Market, a gas station with a deli inside. I got a chocolate milk and continued to the Graymoor Spiritual Life Center's Ballfield. Set up my tent for the first time in a while, charged my phone at the pavilion, and I got some snacks from the hiker box. At around dinner time I jogged the mile back (without my pack) to the Appalachian Market, got an egg and cheese sandwich and half a quesadilla, and walked back to my tent. FB was able to catch back up to me since I had a short day."
  },
  {
    "date": "2025-04-29",
    "images": [
      "images/0429-1.webp",
      "images/0429-2.webp",
      "images/0429-3.webp"
    ],
    "message": "A nice PUDs start to the day. The trail had the sharpest rocks since PA, but luckily, there were not nearly as many of them. Caught up with FB by 11, even though he started 2 hours ahead. He was talking with a dayhiker, and we all took a selfie so FB and I could keep walking. We stopped for lunch and chatted not too much later. FB ended up leaving lunch before me, and by the time I caught up to him again, he was talking to the same dayhiker. The dayhiker had been on a perfectly timed and placed loop trail such that we ran into him twice. I eventually made it above Canopus Lake and had a great view. Further north, there was a rocky summit with a 911 memorial of a painted US flag. Made it to Ralph's Peak Hiker Cabin, a formerly 4 walled cabin that had 1 wall knocked out to make it a shelter. The first shelter with houses on both sides. The shelter had access to the road, so I got a large veggie pizza and a salad courtesy of FB. Fish Head, a thru hiker that started in GA, joined us in the shelter for the night."
  },
  {
    "date": "2025-04-30",
    "images": [
      "images/0430-1.webp",
      "images/0430-2.webp",
      "images/0430-3.webp"
    ],
    "message": "I had some big climbs to start off the day. Most of the morning, I could hear the highway in the distance. I was fighting a tummy ache all day because of the large pizza and salad I had the night before. Regardless, I challenged myself to get to a road about 20 miles away with a nearby food truck that closed at 3:30. Lucky for me, after those first big climbs of the day, the remaining miles were relatively flat. I saw the largest oak tree on the whole trail (girth 20 ft 4 in), estimated to be over 300 years old. Then I walked through some fields and a long boardwalk that wasn't in great shape. Walked through the Appalachian Trail train station, and then I was at the road I challenged myself to get to and it was only 3 pm. I stopped at the Malaysian food truck to get some noodles with tofu and a boba thai tea. Finally caught up with Spice at the food truck, who I hadn't seen since our first meeting in MD. Got back onto the trail and caught up with Luscious, who I also hadn't seen in a while. Made it to the shelter that FB was already at. That night, I met MLB, a thru hiker that started in GA on March 1st and was averaging 25-30 mile days."
  },
  {
    "date": "2025-05-01",
    "images": [
      "images/0501-1.webp",
      "images/0501-2.webp",
      "images/0501-3.webp"
    ],
    "message": "The day started with the NY-CT border, only 1 mile from my shelter that morning. Then I was walking along the large and thundering Housatonic River, which was the largest river I had walked next to since VA. Made a short detour to a historic covered bridge over the Housatonic. After the bridge, there was a large climb with many climbable boulders sitting next to the trail. Came down from the ridge to the road that led to Kent, CT only to go right back up to the ridgetop. At the top of the climb, I passed both Fish Head and FB. After some PUDs, I made it to Caleb's Peak, which was followed by two long and steep descents back to the Housatonic River. I slipped on the first descent while walking down some steep stairs, and luckily, my backpack caught the brunt of the fall. I took the second descent super slow since I was still scarred from the first one. There were 2 miles of nearly flat and even trail to the shelter on the River. About an hour after I got to the shelter, FB arrived."
  },
  {
    "date": "2025-05-02",
    "images": [
      "images/0502-1.webp",
      "images/0502-2.webp",
      "images/0502-3.webp"
    ],
    "message": "There was a thunderstorm last night with a good amount of rain. Woke up to high humidity and an overcast day. Had more flat section along the river to finish before a large climb to start off the day. By about 10 am, the sun came out and the humidity stayed. Walked through another channel of rock similar to the Lemon Squeezer in NY. Today, I was trying to make it to Mountainside Cafe (17 miles away) for lunch before it closed. I was able to make it to the cafe with plenty of time to spare, maintaining a 3 mile per hour pace over the 17 miles. When I got to the cafe I met Fish Head who I didn't expect to see again. I got a Beyond burger and a strawberry milkshake at the cafe and 2 baked good desserts to go. I only had about 6 miles of hiking left for the day with 1 climb at the very end. After climbing down a hefty cliff on a side trail, I made it to the shelter but I was forced to set up my tent because a whole class from a local college was taking up the shelter and all three tent pads. Thankfully, they were respectful at night."
  },
  {
    "date": "2025-05-03",
    "images": [
      "images/0503-1.webp",
      "images/0503-2.webp",
      "images/0503-3.webp",
      "images/0503-4.webp"
    ],
    "message": "Started the day with a big descent into Salisbury, CT. I made a small detour into town to get a half gallon of chocolate milk and some pastries from the bakery. I drank half the milk and ate most of the pastries, then continued back on the trail. Immediately after town I was faced with a steep climb to the top of Lion's Head. After summiting Lion's Head with a nice view there was a relatively flat section for a couple miles. Following the flat section, I climbed Bear Mountain (interesting that both NY and CT have a Bear Mountain on the trail). When I got to the summit of Bear Mountain, I finished my milk and was gifted a handful of chocolates by some dayhikers. The descent off the summit was quite rocky, necessitating a slower pace. I crossed the CT-MA border shortly after the rocks disappeared. Then I walked into Sage's Ravine, a beautiful, green ravine full of waterfalls. The ravine was much cooler than the ridgeline. Ran into FB and we started hiking together. Our next task was summitting Mt Race, which had a pretty gentle ascent. I left FB behind to go at my normal pace and walked along the precarious cliff line at the top of Mt Race. After summiting Mt Race, a thunderstorm quickly started rolling in. It started pouring rain as I started my climb up the final and tallest mountain, Mt Everett. The trail turned into waterfalls and streams as I climbed the mountain. There was thunder and lightning, but I was counting the timing between them to make sure the storm was far away as I was summiting Mt Everett. When I summitted the rain let up for a bit, but it resumed quickly as I descended. I took a break from the rain at the next shelter and ate some snacks. When I got back to hiking, I caught up to FB, who ended up ahead of me when I stopped. Lucky for us, the rain let up, but the trail was still a giant puddle. We hiked the rest of the way together to the highway since FB had a hotel in town and was letting me crash on the other queen bed. We got a shuttle into town, ate some food at the local Mexican restaurant, and took showers in the hotel room before falling asleep in the warm, dry, cozy beds."
  },
  {
    "date": "2025-05-04",
    "images": [],
    "message": "I initially planned on getting back on the trail today, but the weather outlook made me decide to take a 0 for the day. Woke up in the hotel room and headed down to the free continental breakfast. I stuffed myself with as many cinnamon rolls, eggs, pancakes, and muffins as I could. Lucky for me, FB had woken up early and done our laundry. I walked over to the local grocery store to resupply before it started raining for the day. Had a lazy day and just relaxed most of the day. Soaked my feet in the hotel's hot tub for a bit. FB and I walked to an Italian restaurant for dinner. On the way back, I stopped at McDonald's for a second dessert."
  },
  {
    "date": "2025-05-05",
    "images": [],
    "message": "Had another large breakfast at the hotel, I even filled a plate with food I was going to take on the trail with me. Ended up waiting until midday for FB's niece to pick him up and drop me off on the trail. Within minutes of starting the trail, my feet were soaked by walking through puddles. When I stopped for a late lunch at the first shelter I passed, there was a section hiker setting up camp. He seemed quite familiar and we got to chatting, eventually we realized that we had met before. I had met him when he was doing a section hike in Northern Virginia, south of Shenandoah, where he gave me a pizza MRE and other snacks. What are the chances that we would run into each other again! Luckily, there was no rain until I made it to the shelter. Bare Tracks, a barefoot thru hiker finishing his hike from last year, was already half asleep when I got there. A dayhiker named Lentil stopped in to talk to us for a bit."
  },
  {
    "date": "2025-05-06",
    "images": [
      "images/0506-1.webp",
      "images/0506-2.webp",
      "images/0506-3.webp"
    ],
    "message": "I began the day with wet socks and shoes. Most of the time, I was walking through puddles or streams on the trail due to the rain over the past couple of days. There wasn't any rain in the morning, but it was quite misty. Made it to the most useless boardwalk that had large sections missing where you just had to walk through shin-deep water. I caught up with Bare Tracks, who had started hiking before I woke, and we hiked together for a bit. It was quite impressive to see him hiking barefoot. He seemed to be having a much better time on the wet trail than me in my socks and shoes. I eventually hiked on from Bare Tracks and it started to rain as I made it to Upper Goose Pond. I didn't want to make the half mile detour to the shelter for lunch, so I kept walking until I had shelter from the rain under the I-90 overpass bridge. I quickly made my normal peanut butter tortilla and walked in the rain as I ate it. There was a good amount of creek fording required today due to the wet weather over the past couple of days. The sun came out after I made it to my shelter for the evening. Bare Tracks made it to the shelter with an hour to spare before sunset."
  },
  {
    "date": "2025-05-07",
    "images": [
      "images/0507-1.webp",
      "images/0507-2.webp",
      "images/0507-3.webp",
      "images/0507-4.webp"
    ],
    "message": "Another day starting off with wet socks and shoes. Said goodbye to Bare Tracks as I left the shelter. The sun was out, but the trail was still really wet. The hiking was relatively chill until Dalton, MA. The descent into Dalton was a giant mud slide. The trail goes right through the town of Dalton, with blazes on the sidewalk in front of homes. I took a short detour for lunch at the local burrito restaurant and got a crunchwrap for lunch. After lunch, I had to make sure I was timely over the next 9 mi as I needed to get to the post office in Cheshire before it closed. The next 9 miles led me up 1000 ft to a nice view of Cheshire and Mt Greylock from the Cobbles, then back down 1000 ft to Cheshire. The trail once again went right through town. I made it to the post office with plenty of time to spare and picked up my package of guidebook pages and snacks. Leaving Cheshire, I only had 4.4 mi left till the shelter, but there was 1900 ft of ascent left. I made it to the shelter where I was joined by a married couple that was section hiking the trail on their anniversary.  They had completed the whole trail from GA to that point over the last 19 years. They gave me lots of snacks since they were going to a hotel the next night."
  },
  {
    "date": "2025-05-08",
    "images": [
      "images/0508-1.webp",
      "images/0508-2.webp",
      "images/0508-3.webp",
      "images/0508-4.webp",
      "images/0508-5.webp"
    ],
    "message": "Started the day as bit later than normal. I had 600 ft and 3 miles to the top of Mt Greylock, the highest point in MA. Near the summit of Mt Greylock, the forest became very small pine trees with lots of fog, making it feel quite eerie. I had the whole summit to myself, but there was absolutely no view as the clouds obscured everything. My socks were finally able to dry off after the last 3 days or so of being soaked. Had to descend around 2,000 ft to get to North Adams. I made a detour to a supermarket only half a mile off trail. I resupplied, bought lunch, and charged my devices from noon to 2. I left North Adams and had to climb back up to the MA-VT border. The southern border of Vermont is the southern terminus of the Long Trail, which shares the trail with the AT for the first 105 miles of VT. Once I crossed into VT, it felt like the plants were growing more into the trail and there were far fewer blazes to follow. The eerie fog I started the day with came back as I was nearing my shelter for the night. Thankfully, the fog went away after I got to my shelter for the night. Had the whole shelter to myself."
  },
  {
    "date": "2025-05-09",
    "images": [
      "images/0509-1.webp",
      "images/0509-2.webp",
      "images/0509-3.webp"
    ],
    "message": "Another wet and rainy day on the trail. Most of the trail was either a puddle or a stream. The trail blazes today were much more frequent than they were last evening, so there must have been an issue with just a small section. The morning hike was a blur until the steep descent down to cross VT 9. Due to all the wet, I slipped once my way down, but thankfully, nothing was injured. I climbed back out after the road crossing, going up nearly the same height as I came down. I kept climbing until I reached my shelter on the side of Glastenbury Mountain. When I got to the shelter, I realized all my clothes had gotten wet through my rain jacket and rain pants. I just took everything off and crawled into my sleeping bag. I stayed there for most of the evening until I went to bed."
  },
  {
    "date": "2025-05-10",
    "images": [
      "images/0510-1.webp",
      "images/0510-2.webp"
    ],
    "message": "Thankful that there was no rain or wind when I woke up, just a bit of mist. I had to put on all of my cold and wet clothes to start the day. I was at the top of Glastenbury Mountain within 10 minutes of starting the day. The trail was mostly downhill for the next 12 miles. Unfortunately, the trail was still mostly a giant puddle. I ran into the first hiker I had seen for the past 36 hours or so. Then, I was tasked with climbing 2,000 ft to summit Stratton Mountain.  There were a decent amount of tree blow downs on the climb that I had to bushwhack to get around. At the top of the mountain, I climbed the tower to get a view, but all I saw was the white of clouds in every direction. When I got down off the mountain, I met a group of trail maintainers that were surprised I didn't see any snow at the top of the mountain. The mist started clearing up, and the clouds started to open up. I eventually made it to Prospect Rock with an amazing view of Manchester Center, the first view I got since entering VT. The sun was out by the time I made it to the shelter. I was planning on drying out my clothes using the wood stove in the fully enclosed shelter, but I couldn't get any dry wood to start the stove. My clothes had mostly dried during the day as I hiked in them. The only thing that was still wet were my socks and shoes."
  },
  {
    "date": "2025-05-11",
    "images": [
      "images/0511-1.webp",
      "images/0511-2.webp",
      "images/0511-3.webp",
      "images/0511-4.webp"
    ],
    "message": "Finally, a beautiful day for hiking with a perfect hiking temperature. Walked up a ski slope that felt very steep, realized when I got to the top of the run that it was only a green run. At the top of Mt Bromley, part of a ski resort, I was able to stop in at the ski patrol warming hut that they keep open. There were working outlets and even a clothes dryer that I dried my socks in. When my phone was charged and the drier was done, I descended the mountain. Due to the amazing weather, lots of dayhikers were out and climbing the mountain. Climbed up a rocky slab to get to Baker Peak. I crossed several streams where the trail maintainers installed a single I-beam as the bridge, which I thought was pretty ingenious. I eventually crossed the Big Black Branch bridge, a large suspension bridge. I was less than a mile from my shelter and ran into a dayhiker on the trail named Ken that I sat down and talked to for a bit about the trail and his recent adventures. I made it to the shelter, which was on the edge of a nice pond in between mountains. I had the whole 12-person shelter to myself for the night."
  },
  {
    "date": "2025-05-12",
    "images": [
      "images/0512-1.webp",
      "images/0512-2.webp",
      "images/0512-3.webp",
      "images/0512-4.webp"
    ],
    "message": "Slept in till 8:30 today to give my body some extra rest. I began the day by hiking around the beautiful pond. After an hour of hiking, I made it to White Rocks Cliff with another great view. Not long after, I made it to VT 140 and watched my shuttle driver pull up at the exact same time that I arrived. I had to shuttle around about 6 miles of the trail due to the closure of the Clarendon Gorge bridge. The shuttle dropped me off on VT 103, immediately after the closed bridge. I had a big climb right after the road with a nice amount of rock scrambling. I took a break at the next shelter for lunch and more water. Right after the shelter, the trail seemed to go straight up the next hill (500 ft of ascent in 0.5 mi) , with no switchbacks or anything. Ran into the first thru hikers have seen since entering VT, Sunflower and Just Mike. The end of the day was a 2,000 ft climb over 4 mi to get pretty close to the summit of Mt Killington. There were a ton of blow downs on the ascent, requiring bushwhacking, crawling, climbing, and limbo-ing. Despite my best efforts, I still fell over while going through one of the blow downs. The blow downs definitely made the climb less monotonous, and it went by pretty quickly. Eventually, I made it to the shelter near the peak of Mt. Killington (the closest that the trail got to the peak), it was a fully enclosed but pretty rundown shelter. Just Mike caught back up to me and kept walking to the next shelter. Then, a dayhiker came in and offered me fresh fruit and granola bars that I couldn't say no to."
  },
  {
    "date": "2025-05-13",
    "images": [
      "images/0513-1.webp",
      "images/0513-2.webp",
      "images/0513-3.webp",
      "images/0513-4.webp"
    ],
    "message": "Woke up at 4:30 so I could see the sunrise from the summit of Mt. Killington. I ended up watching the sunrise from the porch of the ski resort cantina on the summit of the mountain because it had the best view. The sunrise was incredible with amazing views from the summit in all directions. After sunrise, I only had a little over 9 mi until my stopping point where a bus could pick me up and bring me to Rutland, VT, my extraction point to go to commencement in Pittsburgh. I took the bus from the town of Killington to Johnny Boys Pancake House and had an awesome brunch time meal of maple french toast with mascarpone and apples. I walked from the restaurant to the only hostel in town, above the Yellow Deli. At the hostel I did my laundry, took a shower, and charged my devices. I went to the local co-op to buy some VT maple syrup to bring home. I had way too much Indian food for dinner and was almost too stuffed to sleep."
  }
]