[
  {
    "date": "2025-03-14",
    "images": [
      "images/day0.webp"
    ],
    "message": "Day 0 on trail: didn't sleep much on the plane from SF to Roanoke, but was still energized when I landed. Walked to pick up some food and supplies, I somehow ended up with like 17lbs of food 😅. then took a bus and shuttle to the trail. Before I even stepped foot on the trail I ended up with a pocket full of yogurt 🤣. Hike started with a big climb to a beautiful vista at McAfees knob. There looks to be tons of bouldering potential around the knob. Then kept hiking past Tinker cliffs, another beautiful vista, with lots of short trad potential. Stayed the night at Lamberts meadow shelter"
  },
  {
    "date": "2025-03-15",
    "images": [],
    "message": "Day 1- woke to insane morning fog, couldn't see the other tents less than 30 ft away. Fog gradually faded and was gone by 10. Caught up to 2 brothers that slept at the same shelter that night and hiked with them till Daleville. Got lunch in Daleville (@ cracker barrel, not a great choice). Hiked to the next shelter to prepare for the coming thunderstorm."
  },
  {
    "date": "2025-03-16",
    "images": [
      "images/day2.webp"
    ],
    "message": "Day 2- thunderstorm never came, but there was crazy dense fog in the middle of the night, couldn't see more than 3 feet. Insanely windy and damp all morning. Left the shelter at noon since it was on top of the Knob for a better time at the next shelter. Weather got better as soon as I left the knob."
  },
  {
    "date": "2025-03-17",
    "images": [
      "images/day3.webp"
    ],
    "message": "Day 3- Slept in till almost 9 despite the sun bearing down on me. Trail started weaving through Blue Ridge Parkway with beautiful vistas on both sides. Was about to go to sleep for the night when I met the first other thru hiker: Rope Bunny, who had just finished a 25 mile day (what I had just done in the past 2.5 days)."
  },
  {
    "date": "2025-03-18",
    "images": [
      "images/day4.webp"
    ],
    "message": "Day 4- After setting off from the shelter ahead of Rope Bunny, we did a bunch of back and forth for the rest of the morning, stopping for various things like water. As Rope Bunny told me, 'You can never really say goodbye on the trail.' We met for the possibly the last time (assuming I never catch up) at the shelter (more like a mansion) I was staying at for the night. Still had most of the day left, so played a bunch of solitaire (assuming I remembered the rules correctly)."
  },
  {
    "date": "2025-03-19",
    "images": [
      "images/day5-1.webp",
      "images/day5-2.webp",
      "images/day5-3.webp"
    ],
    "message": "Day 5- Met a section hiker in the morning who told me Wigle Distillery in Pittsburgh was named after one of the first people granted a presidential pardon, his ancestor. Hiked to the highest point I will reach on the trail, Apple Orchard Mountain at 4,225 ft, until Mt. Moosilauke in NH (highest point on the trail is Clingmans Dome in TN). Walked under the Guillotine, a large boulder suspended between other boulders. Made it to my shelter for the night where I met another section hiker who is on his last night of this section and gave me some food (a pizza MRE among other things)."
  },
  {
    "date": "2025-03-20",
    "images": [
      "images/day6-1.webp",
      "images/day6-2.webp"
    ],
    "message": "Got a beautiful view of the James River, which I then had to walk down 2000 ft to get to. Walked across the James River Foot Bridge, the longest foot-use-only bridge on the AT to highway 501. Stuck my thumb out for my first hitch ever and the first car that passed pulled over and gave me a ride to Glasgow VA. Got some wonderful Italian food from the local restaurant and called it a night at the towns hiker shelter."
  },
  {
    "date": "2025-03-21",
    "images": [],
    "message": "First 0 day. Did my laundry for the first time, put everything in the washer and dryer as I sat commando in my rain gear. Resupplied and relaxed."
  },
  {
    "date": "2025-03-22",
    "images": [
      "images/0322-1.webp",
      "images/0322-2.webp"
    ],
    "message": "Got a free shower from a hostel that wasn't even open. Hitched back to the trail. Tons of people on this section of the trail from trail runners to section hikers. Accidentally went 10 miles (mostly uphill) with only 1 L of water. Busy shelter tonight with 5 other people staying."
  },
  {
    "date": "2025-03-23",
    "images": [
      "images/0323.webp"
    ],
    "message": "Got some advice from a thru hiker finishing his SOBO journey that was stopped by Helene last year. Spent most of the morning playing leapfrog with section hikers on the same itinerary as me. Finished the day with a long climb to the shelter. A day hiker made some camp bread with honey butter for me. Another busy night in the shelter."
  },
  {
    "date": "2025-03-24",
    "images": [
      "images/0324.webp"
    ],
    "message": "Rainy morning start up to the peak of Cole Mountain, an appalachian bald. When I got to the peak, fog started rolling in that stayed for a couple of hours. Wet rocks caused me to slip a foot into one of the creeks I was going over. Once I got to the shelter I went to get water and once again doused my foot in a bog. 5 people at the shelter again, possibly last night with the 3 section hikers I have been hiking with for the past few days."
  },
  {
    "date": "2025-03-25",
    "images": [
      "images/0325.webp"
    ],
    "message": "Long decline at the start of the day, just to go right back up to the same elevation by the end of the day. Spent the morning trying to outrun afternoon rain, wasn't successful but the rain wasn't too bad. First night alone in a shelter in a while."
  },
  {
    "date": "2025-03-26",
    "images": [
      "images/0326-1.webp",
      "images/0326-2.webp"
    ],
    "message": "Woke up before sunrise, packed and got ready to go as fast as possible. Then started booking it for Waynesboro VA, about 20 miles away. Made it to a shelter for lunch where I met a PCT thru hiker checking out the AT for the first time. Made it to Waynesboro by 3:45, making 20 miles in just about 7 and a half hours. Got some mail, did laundry and had a nice Indian dinner. Unfortunately the free tenting area wasn't open so I was forced to spend the night in a hotel and took a nice warm shower."
  },
  {
    "date": "2025-03-27",
    "images": [
      "images/0327-1.webp",
      "images/0327-2.webp",
      "images/0327-3.webp"
    ],
    "message": "Had as much food as I could at the mediocre continental breakfast at the hotel. Went to the post office to get rid of a couple things. Resupplied at Kroger for all of Shenandoah. Had a huge sandwich at the local deli (Delly Up) and then got a hitch to the trail. Short hike with a lot of other day hikers. Was too full from town food to have dinner, just had some chocolate. 2 other hikers joined at the shelter, but cowboy camped away from the shelter and didn't say much to me."
  },
  {
    "date": "2025-03-28",
    "images": [],
    "message": "Boring day with no vistas. I was worried about no springs on the trail until the next shelter, so I mistakenly brought 3 liters. Only ended up using 1 before I got to the next shelter. Met 3 other thru hikers at the shelter, 2 of whom stayed with me the previous night. 1 thru hiker, Jimni, was just 20 miles into her journey while the other 2, a father daughter pair, started in Georgia mid-February. 4 other backpackers joined at the shelter for the night."
  },
  {
    "date": "2025-03-29",
    "images": [
      "images/0329.webp"
    ],
    "message": "Started the day by getting to the rocky summit ledge of Blackrock Mountain. Lots of vistas overlooking the valley below. 1st real hot day on the trail. A bit underwhelmed by Shenandoah; hasn't felt very secluded as you can almost always hear cars (or motorcycles) on Skyline Drive. A section hiker named Greenwave that stayed the night at the same shelter before joined me for another night."
  },
  {
    "date": "2025-03-30",
    "images": [
      "images/0330-1.webp",
      "images/0330-2.webp",
      "images/0330-3.webp"
    ],
    "message": "Very chill morning with mostly flat trail. Spent a lot of the morning leapfrogging Greenwave. Eventually, I made it to Lewis Mountain Campstore, one of two open stores in the park, where i bought snacks and some ice cream. Hung out at the campstore to eat lunch and charge my phone. Then continued to Rock Spring Hut, seeing some wild turkeys on the way. Met up with the father daughter thru hiker pair, Too Easy and Frozen at the shelter where we could hear lots of children staying at the Cabin 0.1 miles down the hill."
  },
  {
    "date": "2025-03-31",
    "images": [
      "images/0331-1.webp",
      "images/0331-2.webp",
      "images/0331-3.webp"
    ],
    "message": "Started the day early to try to outrun the storm forecast for 2pm. Right after the rain ended at 7ish I hit the trail. Made it to the summit of Stony Man Mountain, the highest point on the trail in Shenandoah. Then made it to Mary's Rock where I met a very nice hiker named Slo who gave me 2 stinger waffles. Got to the shelter by 2pm and hung out watching the birds and deer wander right up to the shelter. Storm started at 6pm, wasn't as bad as it was forecasted."
  },
  {
    "date": "2025-04-01",
    "images": [],
    "message": "Slow morning for a shorter, rest-like day. Had lunch at a, unfortunately closed, wayside. Got to the shelter, but decided not to sleep in it due to the resident Rat, named Anabelle, that has lived there for years and steals people's things. Once again, Frozen and Too Easy caught up to me and stayed at the same shelter. Dylan came at dusk and brought glorious camaraderie, pizza and permethrin (don't want to get Lyme disease). All things that I needed to keep me going."
  },
  {
    "date": "2025-04-02",
    "images": [
      "images/0402-1.webp",
      "images/0402-2.webp"
    ],
    "message": "Started the day early so I could get to Front Royal and not have to spend the night there. Quickly summited Marshall Mountain. As I was leaving Shenandoah National Park and descending into the valley, it seemed like I was fast forwarding through spring – tons of green, red and purple in the trees which were not evident in the park. Hitched a ride to Front Royal (after being engulfed by black smoke of a passing truck rolling coal), picked up my package of gourmet freeze dried meals from my dad, and headed out for lunch. Ended up with a breakfast burrito, empanada, and cinnamon roll (which I had been dreaming about for the past couple days). Went next door to the local outfitter where they gave me some free cord as backup for my tent cord. Then hung out at the brewery until the local, free trolley took me back to the trail. Made it to a glorious shelter with horseshoe, pavilion, deck, and a solar shower, with enough time to make dinner before sundown."
  },
  {
    "date": "2025-04-03",
    "images": [
      "images/0403-1.webp",
      "images/0403-2.webp"
    ],
    "message": "Nice and relaxing morning hanging out at the beautiful shelter to kill time since I'm only hiking 10 miles. Ate both breakfast and lunch at the shelter, but was eventually chased out of the shelter by a growing horde of hornets (that were not there last night). Very humid day, but an easy hike. Got to a creek and filled up water, anticipating another hour of hiking, but then turned a corner and the shelter was there. Met another 2 thru hikers: Meant2Be, started at the south of Shenandoah, and  Spartacus, started in GA in February. Spartacus told me about his snowy time in the Smoky Mountains and how he regularly does 25+ mi days."
  },
  {
    "date": "2025-04-04",
    "images": [
      "images/0404-1.webp",
      "images/0404-2.webp"
    ],
    "message": "Super heavy rain last night. Was supposed to rain most of the day, but only a light drizzle when I started hiking in the morning. Leapfrogged some section hikers for the easy morning. Then plunged into the roller coaster, 13.5 mi of tightly packed ascents and descents, after lunch. The roller coaster was somewhat similar to the Rachel Carson Trail in Pittsburgh, PA, but lacked the steepness that the RCT has. All of the hills on the roller coaster were as tall as the tallest hill on the RCT. As soon as you got up the hill, you just go right back down the other side. I did 10 out of the 13.5 mi and then Noah picked me up for a relaxing weekend in NoVA. We went to a delicious TexMex place nearby for lunch."
  },
  {
    "date": "2025-04-05",
    "images": [
      "images/0405.webp"
    ],
    "message": "Zero day in NoVA with Noah. Started the day with a fancy all you can eat breakfast at the local Hilton, where I ate too much food and was too full to function for a few hours. We then went to REI so I could get a smaller and more functional knife. Resupplied at the local Wegmans. We ended the day with a short metro trip to Virginia Square for a large Italian dinner. We walked around a little and got some ice cream and a freshly baked cookie. Was able to spray my clothes and tent with the permethrin from Dylan, so hopefully no ticks for the next month. Capped off the night with a new spy movie at Noah's place."
  },
  {
    "date": "2025-04-06",
    "images": [
      "images/0406-1.webp",
      "images/0406-2.webp",
      "images/0406-3.webp"
    ],
    "message": "Started the day off right with some delicious cheese blintzes with Noah. Then he drove me back to where he picked me up from, and I started back on the trail.  At first I forgot I was in the middle of the Rollercoaster, but quickly realized as I was going up and down hills. Finished the last 3 miles of the Rollercoaster and encountered my first state line. Took a long break at the Blackburn AT Center which had a nice hiker bunk with a wood stove inside. Got to the shelter for the night with plenty of light left."
  },
  {
    "date": "2025-04-07",
    "images": [
      "images/0407-1.webp",
      "images/0407-2.webp",
      "images/0407-3.webp",
      "images/0407-4.webp",
      "images/0407-5.webp"
    ],
    "message": "Woke up to another cold, foggy, and rainy morning. Relatively easy morning hike into Harper's Ferry, WV. Made it to the Appalachian Trail Conservancy Headquarters by noon. I registered as a thru hiker, got my picture in the book, and got my AT hangtag for my bag (even got a gold star for my knowledge of leave no trace principles). Had lunch at a local sandwich shop which was overwhelmed with a bunch of elementary or middle school kids on a field trip. Then had the flattest 3 miles of the trail as I walked on the path shared with the C&O canal towpath (which I biked with Monica almost 2 years ago). The trail quickly gained over 1000 ft of elevation to get to the top of the ridge where the trail stays for the remainder of Maryland. Walked through 3 different states today."
  },
  {
    "date": "2025-04-08",
    "images": [
      "images/0408-1.webp",
      "images/0408-2.webp",
      "images/0408-3.webp"
    ],
    "message": "Walked for 5-10 minutes on what seemed like the trail, but it turned out to not be the trail. A good lesson to always keep an eye out for trail blazes. Was hoping to get a free shower at the local backpacker's campground, but it was still closed for the season. Saw the first monument constructed for George Washington, built by the townspeople of Boonsboro, MD on July 4th, 1830. Saw the first set of people maintaining the trail where I tested out some rocks they had just placed in the trail. Met a group of trail patrol people who gave me a granola bar (don't ever say no to trail magic). Made it to my initially planned shelter, but decided I'd rather go 5 more miles to the nicer shelter. Walked through the first meadows I've encountered so far and stood at the top of Raven Rocks with an amazing view. Started getting cold as soon as I made it to the final shelter for the night."
  },
  {
    "date": "2025-04-09",
    "images": [
      "images/0409-1.webp",
      "images/0409-2.webp",
      "images/0409-3.webp",
      "images/0409-4.webp",
      "images/0409-5.webp",
      "images/0409-6.webp"
    ],
    "message": "Coldest night so far last night, woke up to another partially frozen water bottle. Made a quick stop at High Rock in Maryland for a nice view and tons of graffiti. Finished off Maryland and crossed the Mason-Dixon line into Pennsylvania. Less than 5 minutes after entering PA, a man on the trail asked me if I saw a big bird, I said no and we both went on our way. Later bumped into another thru hiker who told me that man was looking for a missing emu that had been spotted by other hikers on the trail. Hitched into Rouzerville, PA and picked up my second pair of shoes and a boatload of yummy snacks that Monica sent to me. Ate a whole medium size pizza at the local pizza joint and resupplied at the local Walmart. I was packing up my bag at the local Sheetz, getting ready to head back to the trail, and a man came out of the store to offer me a ride back to the trail when he bought what he needed. Then had a short 6 mile finish to the day."
  },
  {
    "date": "2025-04-10",
    "images": [
      "images/0410-1.webp"
    ],
    "message": "The day started out both cold and rainy. I didn't expect the rain to continue, so I started hiking without any rain gear on. Eventually I got too cold and wet, so I ended up throwing on both my rain jacket and pants. Dealing with a shin splint issue on only my left leg, but was testing out a shorter stride and better footstrike that seemed to alleviate all the pain (along with the new and better shoes). Ended the day early at one of the nicest shelters so far because the shelter I planned on stopping at was closed for a Bat Bug infestation. A section hiker named Unexpected stayed at the shelter with me where we played checkers until we got too cold and retreated to our sleeping bags. He was named Unexpected because he saw the loose emu on trail in Maryland a couple days ago."
  },
  {
    "date": "2025-04-11",
    "images": [
      "images/0411-1.webp",
      "images/0411-2.webp"
    ],
    "message": "Yet another cold day on the trail. Thankfully, it was not rainy like yesterday, but I didn't see the sun all day due to heavy fog. No shin splint pain; seems like the change in stride, footstrike, and shorter days seem to be helping. Finally saw a video of the loose Emu from a pair of thru hikers, Almighty and Feisty, that I had met on my last night in Maryland. Passed the official halfway point on the trail. Spent most of the afternoon, staying warm in my sleeping bag since I took another short day for the shin splint."
  },
  {
    "date": "2025-04-12",
    "images": [
      "images/0412-1.webp",
      "images/0412-2.webp"
    ],
    "message": "Woke to another grey morning, but thankfully, there was no rain. After a short walk, I made it to the halfway ceremonial marker that doesn't ever move. Then I rolled into Pine Grove Furnace State Park, where I was hoping to explore the AT Museum, but unfortunately, it was closed. Julia and Rick met up with me at the State Park and gave me a wonderful, warm McDonald's second breakfast. After eating, we all started hiking to the next shelter for the night. We stopped for a beautiful view at Pole Steeple and made it to the shelter with tons of time to hang out before dark. Eventually, Fiesty and Almighty caught up to us at the shelter. We played some cards and chatted until the sun set. At some point,  Luscious, who I haven't seen since Glasgow, VA, made it to the shelter. All in all, a wonderful day."
  },
  {
    "date": "2025-04-13",
    "images": [
      "images/0413-1.webp",
      "images/0413-2.webp"
    ],
    "message": "Sad start to the day saying goodbye to Rick and Julia so they could walk back to their car while I carried on to the North. Less than 2 miles after starting the day, there was a deli that I stopped at for a small resupply and food. Seconds after stepping onto the porch of the deli, my nose started randomly gushing blood, and I rushed to stuff toilet paper up my nose to not get blood all over everything. Ended up with blood on my clothes, backpack, and even the porch of the deli. Bought an egg and cheese sandwich, fresh baked cinnamon sticks, and a fried fish sub from the deli with a wad of toilet paper stuffed up my nose. Once it seemed like the nosebleed had stopped, I continued hiking for the day with a wad of toilet paper up my nose just in case. Scrambled through a cool rock maze where I had to set my trekking poles down at one point to get over a rock. Finished the short hike by 1pm and hung out at the shelter, waiting for Fiesty and Almighty to catch up with me.  They made it in about 1.5 hours later, and we chatted for the rest of the evening. As soon as we all laid down to sleep for the evening, we heard a large pack of coyotes howling not too far from our shelter, a cool but eerie sound."
  },
  {
    "date": "2025-04-14",
    "images": [
      "images/0414-1.webp",
      "images/0414-2.webp",
      "images/0414-3.webp"
    ],
    "message": "Said goodbye to Fiesty and Almighty, possibly for the last time, as I was going to start picking up the pace again since my shin splint was feeling better. Made it to Center Point knob then walked out into fields and pastures for the next 10 miles. As soon as I got into the fields I saw a pair of bald eagles flying from tree to tree as I walked towards them. Stopped in Boiling Springs for breakfast at a restaurant. After finishing my food, I asked the waiter for my check, but he informed me that the people that had just left paid for my meal, a wonderful instance of trail magic. Continued walking through pastures and stopped at an ATC owned farm for lunch, and a day hiker gave me a Larabar (two instances of trail magic in one day!). I made it back into the mountains where my shelter was by the end of the day."
  }
]