[
  {
    "date": "2025-03-14",
    "images": ["images/day0.jpg"],
    "message": "Day 0 on trail: didn't sleep much on the plane from SF to Roanoke, but was still energized when I landed. Walked to pick up some food and supplies, I somehow ended up with like 17lbs of food 😅. then took a bus and shuttle to the trail. Before I even stepped foot on the trail I ended up with a pocket full of yogurt 🤣. Hike started with a big climb to a beautiful vista at McAfees knob. There looks to be tons of bouldering potential around the knob. Then kept hiking past Tinker cliffs, another beautiful vista, with lots of short trad potential. Stayed the night at Lamberts meadow shelter"
  },
  {
    "date": "2025-03-15",
    "images": [],
    "message": "Day 1- woke to insane morning fog, couldn't see the other tents less than 30 ft away. Fog gradually faded and was gone by 10. Caught up to 2 brothers that slept at the same shelter that night and hiked with them till Daleville. Got lunch in Daleville (@ cracker barrel, not a great choice). Hiked to the next shelter to prepare for the coming thunderstorm."
  },
  {
    "date": "2025-03-16",
    "images": ["images/day2.jpg"],
    "message": "Day 2- thunderstorm never came, but there was crazy dense fog in the middle of the night, couldn't see more than 3 feet. Insanely windy and damp all morning. Left the shelter at noon since it was on top of the Knob for a better time at the next shelter. Weather got better as soon as I left the knob."
  },
  {
      "date": "2025-03-17",
      "images": ["images/day3.jpg"],
      "message": "Day 3- Slept in till almost 9 despite the sun bearing down on me. Trail started weaving through Blue Ridge Parkway with beautiful vistas on both sides. Was about to go to sleep for the night when I met the first other thru hiker: Rope Bunny, who had just finished a 25 mile day (what I had just done in the past 2.5 days)."
  },
  {
      "date": "2025-03-18",
      "images": ["images/day4.jpg"],
      "message": "Day 4- After setting off from the shelter ahead of Rope Bunny, we did a bunch of back and forth for the rest of the morning, stopping for various things like water. As Rope Bunny told me, 'You can never really say goodbye on the trail.' We met for the possibly the last time (assuming I never catch up) at the shelter (more like a mansion) I was staying at for the night. Still had most of the day left, so played a bunch of solitaire (assuming I remembered the rules correctly)."
  },
  {
      "date": "2025-03-19",
      "images": ["images/day5-1.jpg", "images/day5-2.jpg", "images/day5-3.jpg"],
      "message": "Day 5- Met a section hiker in the morning who told me Wigle Distillery in Pittsburgh was named after one of the first people granted a presidential pardon, his ancestor. Hiked to the highest point I will reach on the trail, Apple Orchard Mountain at 4,225 ft, until Mt. Moosilauke in NH (highest point on the trail is Clingmans Dome in TN). Walked under the Guillotine, a large boulder suspended between other boulders. Made it to my shelter for the night where I met another section hiker who is on his last night of this section and gave me some food (a pizza MRE among other things)."
  },
  {
      "date": "2025-03-20",
      "images": ["images/day6-1.jpg", "images/day6-2.jpg"],
      "message": "Got a beautiful view of the James River, which I then had to walk down 2000 ft to get to. Walked across the James River Foot Bridge, the longest foot-use-only bridge on the AT to highway 501. Stuck my thumb out for my first hitch ever and the first car that passed pulled over and gave me a ride to Glasgow VA. Got some wonderful Italian food from the local restaurant and called it a night at the towns hiker shelter."
  }
]

